In [1]:
#Group By
import pandas as pd

In [6]:
var1=pd.DataFrame({"Name":["a","b","c","d","a","b","a","b","a","c","c"],"Subject_1":[1,21,11,23,14,15,22,11,9,1,24],"Subject_2":[1,2,3,4,5,6,7,8,9,11,12]})
var1

   Name  Subject_1  Subject_2
0     a          1          1
1     b         21          2
2     c         11          3
3     d         23          4
4     a         14          5
5     b         15          6
6     a         22          7
7     b         11          8
8     a          9          9
9     c          1         11
10    c         24         12

In [8]:
var_2=var1.groupby("Name")
var_2

In [10]:
#to view groupby data
for x,y in var_2:
    print(x)
    print(y)
    print()

a
  Name  Subject_1  Subject_2
0    a          1          1
4    a         14          5
6    a         22          7
8    a          9          9

b
  Name  Subject_1  Subject_2
1    b         21          2
5    b         15          6
7    b         11          8

c
   Name  Subject_1  Subject_2
2     c         11          3
9     c          1         11
10    c         24         12

d
  Name  Subject_1  Subject_2
3    d         23          4

In [12]:
#if wnat to get only group a data
var_2.get_group("a")

  Name  Subject_1  Subject_2
0    a          1          1
4    a         14          5
6    a         22          7
8    a          9          9

In [15]:
#to get min,max,mean  data from dataframe
var_2.min()

      Subject_1  Subject_2
Name
a             1          1
b            11          2
c             1          3
d            23          4

In [16]:
var_2.max()

      Subject_1  Subject_2
Name
a            22          9
b            21          8
c            24         12
d            23          4

In [17]:
var_2.mean()

      Subject_1  Subject_2
Name
a     11.500000   5.500000
b     15.666667   5.333333
c     12.000000   8.666667
d     23.000000   4.000000

In [19]:
#to convert dataframe into list
li=list(var_2)
li

[('a',
    Name  Subject_1  Subject_2
  0    a          1          1
  4    a         14          5
  6    a         22          7
  8    a          9          9),
 ('b',
    Name  Subject_1  Subject_2
  1    b         21          2
  5    b         15          6
  7    b         11          8),
 ('c',
     Name  Subject_1  Subject_2
  2     c         11          3
  9     c          1         11
  10    c         24         12),
 ('d',
    Name  Subject_1  Subject_2
  3    d         23          4)]